/****************************************************************************/ /**
 * @file   74hc595.c
 * @brief  74HC595 串行到并行的数据转换
 * 
 * @author Maverick Pi
 * @date   2025-07-06 14:28:29
 ********************************************************************************/

#include "74hc595.h"

/**
 * @brief 串行数据转并行数据输出
 * 
 * @param byte 串行数据
 */
void WriteByte_74HC595(u8 byte)
{
    u8 i;
    SRCLK_74HC595 = 0;
    RCLK_74HC595 = 0;

    for (i = 0; i < 8; ++i) {
        SER_74HC595 = byte & (0x80 >> i);
        SRCLK_74HC595 = 1;
        SRCLK_74HC595 = 0;
    }

    RCLK_74HC595 = 1;
    RCLK_74HC595 = 0;
}
