/****************************************************************************/ /**
 * @file   timer.c
 * @brief  定时器模块
 * 
 * @author Maverick Pi
 * @date   2025-06-20 21:52:52
 ********************************************************************************/

#include "timer.h"

/**
 * @brief Timer0 初始化, 1毫秒@11.0592MHz
 * 
 */
void Timer0_Init(void)
{
	TMOD &= 0xF0;			//设置定时器模式
	TMOD |= 0x01;			//设置定时器模式
	TL0 = Timer0_Low;		//设置定时初始值
	TH0 = Timer0_High;		//设置定时初始值
	TF0 = 0;				//清除TF0标志
	TR0 = 1;				//定时器0开始计时
    ET0 = 1;
    EA = 1;
    PT0 = 0;
}
