/****************************************************************************/ /**
 * @file   uart.c
 * @brief  串行口模块
 * 
 * @author Maverick Pi
 * @date   2025-06-30 16:59:47
 ********************************************************************************/

#include "uart.h"

/**
 * @brief 串行口初始化 4800bps@11.0592MHz
 * 
 */
void Uart1_Init(void)
{
	PCON |= 0x80;		//使能波特率倍速位SMOD
	SCON = 0x40;		//8位数据,可变波特率
	TMOD &= 0x0F;		//设置定时器模式
	TMOD |= 0x20;		//设置定时器模式
	TL1 = 0xF4;			//设置定时初始值
	TH1 = 0xF4;			//设置定时重载值
	ET1 = 0;			//禁止定时器中断
	TR1 = 1;			//定时器1开始计时
}

/**
 * @brief 串口发送一个字节数据
 * 
 * @param byte 一个字节数据
 */
void Uart1_SendByte(u8 byte)
{
    SBUF = byte;
    while (TI == 0);
    TI = 0;
}
